app/views/articles/index.html.erb

            </div>
            <% num = article.comments.average(:rate).to_i %>
---
SELECT AVG(`comments`.`rate`) FROM `comments` WHERE `comments`.`article_id` = 47