app/controllers/articles_controller.rb

  def index
    @articles = Article.order("created_at DESC").page(params[:page]).per(20)
    article_ids = Comment.group(:article_id).order('average_rate DESC').limit(10).average(:rate).keys
    @ranking = article_ids.map{ |id| Article.find(id)}
    user_ids = Article.group(:user_id).order('count_id DESC').limit(10).count(:id).keys
    @rankingu = user_ids.map{ |id| User.find(id)}
---
SELECT COUNT(*) FROM `articles`
SELECT  `articles`.* FROM `articles` ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT  `comments`.* FROM `comments` GROUP BY `comments`.`article_id` ORDER BY average_rate DESC LIMIT 10
SELECT  AVG(`comments`.`rate`) AS average_rate, `comments`.`article_id` AS comments_article_id FROM `comments` GROUP BY `comments`.`article_id` ORDER BY average_rate DESC LIMIT 10
SELECT AVG(`comments`.`rate`) FROM `comments` WHERE `comments`.`article_id` = 45
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 41 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` IS NULL
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 39 LIMIT 1

  def show
    @article = Article.find(params[:id])
    @comments = @article.comments.includes(:user)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 39 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 45
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @article = Article.create(article_params)
---
INSERT INTO `articles` (`created_at`, `updated_at`, `title`, `text`, `user_id`) VALUES ('2019-04-25 10:33:49', '2019-04-25 10:33:49', 'aaaaaaaaaaaaaaaaaaaaaaa', 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa', 4)

  def destroy
    article = Article.find(params[:id])
    comments = article.comments
    if article.user_id == current_user.id
      article.destroy
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 24 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 49
DELETE FROM `comments` WHERE `comments`.`id` = 32

  def usershow
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

  def update
    article = Article.find(params[:id])
    if article.user_id == current_user.id
      article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 0 LIMIT 1
UPDATE `articles` SET `title` = 'ggggggggggggggggggggg', `text` = '      aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa\r\n      ', `updated_at` = '2019-04-25 10:34:46' WHERE `articles`.`id` = 48