app/controllers/comments_controller.rb

INSERT INTO `comments` (`text`, `created_at`, `updated_at`, `rate`, `article_id`, `user_id`) VALUES ('ゴンさん', '2019-04-23 08:38:47', '2019-04-23 08:38:47', 3, 38, 2)
---
  def create
    comment = Comment.create(text: comment_params[:text], rate: comment_params[:rate], article_id: comment_params[:article_id], user_id: current_user.id)