app/controllers/users_controller.rb

  def index
    @user = User.find(params[:format])
    @articles = Article.where(user_id: params[:format])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = '2'